STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/hap_app.h
/* CAP Linkup State */
typedef uint8_t APP_CAP_Linkup_State_t;
#define APP_CAP_LINKUP_STATE_NONE               0x00
#define APP_CAP_LINKUP_STATE_STARTED_RESTORE    0x01
#define APP_CAP_LINKUP_STATE_STARTED_COMPLETE   0x02
#define APP_CAP_LINKUP_STATE_DONE_RESTORE       0x03
#define APP_CAP_LINKUP_STATE_DONE_COMPLETE      0x04

/* MCP Client Read State */
typedef uint8_t APP_MCP_Linkup_State_t;
#define APP_MCP_LINKUP_STATE_IDLE                        0x00
#define APP_MCP_LINKUP_STATE_CONFIGURE_TRACK_TITLE_NOTIF 0x01
#define APP_MCP_LINKUP_STATE_READ_MEDIA_STATE            0x02
#define APP_MCP_LINKUP_STATE_READ_TRACK_TITLE            0x03

/* MCP CLient Operation type*/
#define MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION           0x0001u
#define MCP_CLT_OP_MOVE_NEXT_TRACK                              0x0002u
#define MCP_CLT_OP_MOVE_PREVIOUS_TRACK                          0x0004u
#define MCP_CLT_OP_PLAY_TRACK                                   0x0008u
#define MCP_CLT_OP_PAUSE_TRACK                                  0x0010u
#define MCP_CLT_OP_READ_MEDIA_STATE                             0x0020u
#define MCP_CLT_OP_READ_TRACK_TITLE                             0x0040u

/* CCP Client Operation type*/
#define CCP_CLT_OP_READ_CALL_STATE                              0x0100u
#define CCP_CLT_OP_ANSWER_INC_CALL                              0x0200u
#define CCP_CLT_OP_TERMINATE_CALL                               0x0400u
#define CCP_CLT_OP_READ_FEATURES_STATUS                         0x0800u
/*Structure used for ASE information storage*/
typedef struct
{
  uint8_t               ID;
  ASE_State_t           state;
  ASE_Type_t            type;           /*Source of Sink*/
  uint8_t               allocated;
  uint8_t               num_channels;
  uint32_t              presentation_delay;
  uint32_t              controller_delay;
  Audio_Context_t       streaming_audio_context;
  uint8_t               enable_req;
}APP_ASE_Info_t;

typedef struct
{
  uint16_t              acl_conn_handle;
#if (APP_NUM_SNK_ASE > 0)
  APP_ASE_Info_t        aSnkASE[APP_NUM_SNK_ASE];
#endif /* (APP_NUM_SNK_ASE > 0) */
#if (APP_NUM_SRC_ASE > 0)
  APP_ASE_Info_t        aSrcASE[APP_NUM_SRC_ASE];
#endif /* (APP_NUM_SRC_ASE > 0) */
}APP_ASEs_t;

/*Structure used for connection information strorage*/
typedef struct
{
  uint16_t               Acl_Conn_Handle;
  uint8_t                Peer_Address_Type;
  uint8_t                Peer_Address[6];
  uint8_t                Role;
  audio_profile_t        AudioProfile;
  uint8_t                ConfirmIndicationRequired;
  uint8_t                ForceCompleteLinkup;
  uint8_t                LinkupRetry;
  APP_CAP_Linkup_State_t CAPLinkupState;
  uint8_t                GenericMediaPlayerCCID;
  MCP_MediaState_t       MediaState;
  uint8_t                PlayPauseOperation;
  APP_MCP_Linkup_State_t MCPLinkupState;
  uint8_t                GenericTelephoneBearerCCID;
  uint8_t                CurrentCallID;
  CCP_CallState_t        CurrentCallState;
  uint16_t               CurrentContentCtrlOp;
  uint16_t               PendingContentCtrlOp;
  APP_ASEs_t             *pASEs;
  Audio_Context_t        AvailableSnkAudioContext;
  Audio_Context_t        AvailableSrcAudioContext;
}APP_ACL_Conn_t;

typedef struct
{
  BAP_Role_t                    bap_role;

  APP_ACL_Conn_t                ACL_Conn[CFG_BLE_NUM_LINK];

  uint8_t                       NumConn;

  uint8_t                       audio_driver_config;

  Audio_Role_t                  audio_role_setup;

  uint16_t                      cis_src_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_src;

  uint16_t                      cis_snk_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_snk;

  uint16_t                      cis_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_established;

  BAP_AudioCodecController_t    AudioCodecInController;

  BAP_SupportedStandardCodec_t  aStandardCodec[1];

  uint8_t                       NumSnkASEs;

  uint8_t                       NumSrcASEs;

  APP_ASEs_t                    aASEs[CFG_BLE_NUM_LINK];

  Audio_Location_t              SnkAudioLocations;

  Audio_Location_t              SrcAudioLocations;

  Audio_Context_t               SupportedSnkAudioContext;

  Audio_Context_t               SupportedSrcAudioContext;

  Audio_Context_t               AvailableSnkAudioContext;

  Audio_Context_t               AvailableSrcAudioContext;

  /* Codec Specific Capabilities for Sink Record */
#if (APP_NUM_SNK_PAC_RECORDS > 0)

  /* Handle of the Sink Audio Codec Record*/
  uint16_t                      aSnkPACRecordHandle[APP_NUM_SNK_PAC_RECORDS];

  /* Sink Published Audio Capabilities Records slots */
  BAP_AudioPACRecord_t          aSnkPACRecord[APP_NUM_SNK_PAC_RECORDS];

  /* Codec Specific Capabilities */
  uint8_t                       aSnkCap[APP_NUM_SNK_PAC_RECORDS][PACS_CODEC_SPECIFIC_CAPABILITIES_LENGTH];

  /* Metadata*/
  uint8_t                       aSnkMetadata[APP_NUM_SNK_PAC_RECORDS][PACS_SRV_METADATA_SIZE];

#endif /*(APP_NUM_SNK_PAC_RECORDS > 0)*/
  /*Codec Specific Capabilities for Source Record*/
#if (APP_NUM_SRC_PAC_RECORDS > 0)

  /*Handle of the Source PAC Record*/
  uint16_t                      aSrcPACRecordHandle[APP_NUM_SRC_PAC_RECORDS];

  /* Source Published Audio Capabilities Records slots*/
  BAP_AudioPACRecord_t          aSrcPACRecord[APP_NUM_SRC_PAC_RECORDS];

  /* Codec Specific Capabilities */
  uint8_t                       aSrcCap[APP_NUM_SRC_PAC_RECORDS][PACS_CODEC_SPECIFIC_CAPABILITIES_LENGTH];

  /* Metadata*/
  uint8_t                       aSrcMetadata[APP_NUM_SRC_PAC_RECORDS][PACS_SRV_METADATA_SIZE];

#endif /*(APP_NUM_SRC_PAC_RECORDS > 0)*/

  uint8_t                       NumOutputChannels;

#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT)
  uint8_t                       CSIPRank;
#endif /* (APP_CSIP_ROLE_SET_MEMBER_SUPPORT) */
} HAPAPP_Context_t;

typedef struct
{
  Supported_Sampling_Freq_t     Freq;
  Supported_Frame_Duration_t    FrameDuration;
  uint16_t                      MinOctetsPerCodecFrame;
  uint16_t                      MaxOctetsPerCodecFrame;

} APP_CodecCap_t;

typedef struct
{
  Sampling_Freq_t       freq;
  uint32_t              sdu_interval;
  BAP_Framing_t         framing;
  uint16_t              max_sdu;
  uint8_t               rtx_num;
  uint16_t              max_tp_latency;
  uint32_t              presentation_delay;

} APP_QoSConf_t;

typedef struct
{
  uint8_t       NumSnkASEs;
  uint8_t       NumSrcASEs;
  uint8_t       NumAudioChnlsPerSnkASE;
  uint8_t       MinSnkAudioLocations;
  uint8_t       NumAudioChnlsPerSrcASE;
  uint8_t       MinSrcAudioLocations;
  uint8_t       NumCISes;
  uint16_t      NumAudioStreams;

} APP_UnicastAudioConf_t;

typedef struct
{
  uint8_t Index;
  uint8_t Properties;
  char Name[HAP_MAX_PRESET_NAME_LEN+1];
} HAPAPP_Preset_t;


