STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/hap_app.h
/* External variables --------------------------------------------------------*/

/* Exported macros ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions ---------------------------------------------*/
void HAPAPP_Init(uint8_t csip_config_id);
tBleStatus HAPAPP_Linkup(uint16_t ConnHandle);
uint8_t HAPAPP_StartAdvertising(CAP_Announcement_t AnnouncementType,uint8_t EnableSolicitationRequest,
                                 uint16_t Appearance);
uint8_t HAPAPP_StopAdvertising(void);
uint8_t HAPAPP_VolumeUp(void);
uint8_t HAPAPP_VolumeDown(void);
uint8_t HAPAPP_ToggleMute(void);
uint8_t HAPAPP_ToggleMicrophoneMute(void);
tBleStatus HAPAPP_NextPreset(void);
tBleStatus HAPAPP_PreviousPreset(void);
tBleStatus HAPAPP_AnswerCall(void);
tBleStatus HAPAPP_TerminateCall(void);
uint8_t HAPAPP_Disconnect(void);
void HAPAPP_AclConnected(uint16_t Conn_Handle,uint8_t Peer_Address_Type,uint8_t Peer_Address[6],uint8_t role);
void HAPAPP_CISConnected(uint16_t Conn_Handle);
void HAPAPP_LinkDisconnected(uint16_t Conn_Handle,uint8_t Reason);
void HAPAPP_ConfirmIndicationRequired(uint16_t Conn_Handle);
void HAPAPP_BondLost(uint16_t Conn_Handle);
#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)
tBleStatus CSIPAPP_RegisterCSIS(uint8_t instance_id,
                                uint8_t SIRK_OOB,
                                uint8_t SIRK_type,
                                uint8_t* SIRK,
                                uint8_t size,
                                uint8_t rank);
#endif /*APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)*/
#ifdef __cplusplus
}
#endif

#endif /*__HAP_APP_H */
